# Brewfile - macOS development and productivity setup

# General CLI Utilities
brew "bat"                          # Cat clone with syntax highlighting and Git integration
brew "eza"                          # Modern replacement for ls (fork of exa)
brew "gotop"                        # Terminal-based graphical activity monitor
brew "jq"                           # Command-line JSON processor
brew "neofetch"                     # System information tool with ASCII art logo
brew "tree"                         # Display directories as trees

# Developer CLI Tools
brew "act"                          # Run GitHub Actions locally
brew "container-structure-test"     # Test utility for validating container structure
brew "devcontainer"                 # CLI for Visual Studio Code Dev Containers
brew "gh"                           # GitHub CLI for managing issues, PRs, and repos
brew "git-lfs"                      # Git extension for versioning large files

# Shell & Terminal
brew "oh-my-posh"                   # Prompt theme engine for shells
brew "gnu-stow"                     # Dotfiles symlink manager
cask "font-meslo-lg-nerd-font"      # Patched Meslo LG font with developer glyphs
cask "ghostty"                      # Fast, feature-rich GPU-accelerated terminal emulator

# Productivity & Utilities
cask "alfred"                       # Productivity app and Spotlight replacement
cask "bartender"                    # Menu bar item organizer and manager
cask "istat-menus"                  # Advanced system monitoring in menu bar
cask "notchnook"                    # Utility for using the MacBook notch area
cask "snagit"                       # Screen capture and screen recording tool
cask "soulver"                      # Smart calculator with natural language input

# Security & Storage
cask "1password"                    # Password manager desktop app
cask "1password-cli"                # Command-line interface for 1Password
cask "dropbox"                      # File syncing and cloud storage

# Development & Containers
cask "docker-desktop"               # Docker Desktop for container management
cask "lm-studio"                    # Run local large language models
cask "visual-studio-code"           # Code editor with extensive extension ecosystem

# Browsers
cask "brave-browser"                # Privacy-focused web browser

# PDF & Documents
cask "pdf-expert"                   # Powerful PDF editor and reader